<template>
  <div class="container">
    <HeaderPage />
    <AddFormItem />
    <ItemList :items='items' />
  </div>
</template>

<script>
export default {
  name: 'App',
  data () {
    return {
      items: [
        {
          id: 0,
          name: 'Наименование товара',
          description: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк',
          linkImg: '/camera.jpg',
          price: 10000
        },
        {
          id: 1,
          name: 'Наименование товара',
          description: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк',
          linkImg: '/camera.jpg',
          price: 10000
        },
        {
          id: 2,
          name: 'Наименование товара',
          description: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк',
          linkImg: '/camera.jpg',
          price: 10000
        },
        {
          id: 3,
          name: 'Наименование товара',
          description: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк',
          linkImg: '/camera.jpg',
          price: 10000
        },
        {
          id: 4,
          name: 'Наименование товара',
          description: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк',
          linkImg: '/camera.jpg',
          price: 10000
        },
        {
          id: 5,
          name: 'Наименование товара',
          description: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк',
          linkImg: '/camera.jpg',
          price: 10000
        },
        {
          id: 6,
          name: 'Наименование товара',
          description: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк',
          linkImg: '/camera.jpg',
          price: 10000
        },
        {
          id: 7,
          name: 'Наименование товара',
          description: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк',
          linkImg: '/camera.jpg',
          price: 10000
        },
        {
          id: 8,
          name: 'Наименование товара',
          description: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк',
          linkImg: '/camera.jpg',
          price: 10000
        },
        {
          id: 9,
          name: 'Наименование товара',
          description: 'Довольно-таки интересное описание товара в несколько строк. Довольно-таки интересное описание товара в несколько строк',
          linkImg: '/camera.jpg',
          price: 10000
        }
      ]
    }
  }
}
</script>

<style scoped lang='scss'>
  .container {
    padding: 3.2rem;
    padding-bottom: 0;
    max-width: 137.6rem;
    margin: 0 auto;
  }
</style>
